In [1]:
# first i will learn Hierarchical indexing
### 8.1 Hierarchical Indexing

In [2]:
import numpy as np
import pandas as pd

In [3]:
data=pd.Series(np.random.randn(8),
                 index=[['a','b','c','a','b','c','a','c'],
                  [1,2,3,1,2,2,3,3]])

In [4]:
data.index

MultiIndex([('a', 1),
            ('b', 2),
            ('c', 3),
            ('a', 1),
            ('b', 2),
            ('c', 2),
            ('a', 3),
            ('c', 3)],
           )

In [5]:
data.sort_index()

a  1   -0.177240
   1    1.243547
   3    0.254413
b  2    0.186988
   2   -0.962784
c  2   -1.008683
   3   -2.604226
   3    1.169718
dtype: float64

In [6]:
data

a  1   -0.177240
b  2    0.186988
c  3   -2.604226
a  1    1.243547
b  2   -0.962784
c  2   -1.008683
a  3    0.254413
c  3    1.169718
dtype: float64

In [7]:
data.loc[["a","b"]]

a  1   -0.177240
   1    1.243547
   3    0.254413
b  2    0.186988
   2   -0.962784
dtype: float64

In [8]:
data.loc[:,2]

b    0.186988
b   -0.962784
c   -1.008683
dtype: float64

In [9]:
#With a DataFrame, either axis can have a hierarchical index
# [18]
import pandas as pd
import numpy as np
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
        index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
        columns=[['Ohio', 'Ohio', 'Colorado'],
        ['Green', 'Red', 'Green']])
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
display(frame)
frame['Ohio']

#Be careful to distinguish the index names 'state' and 'color'
#from the row labels

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [10]:
frame.swaplevel('key2',"key1").sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [11]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [12]:
frame.stack()

state            Colorado  Ohio
key1 key2 color
a    1    Green       2.0     0
          Red         NaN     1
     2    Green       5.0     3
          Red         NaN     4
b    1    Green       8.0     6
          Red         NaN     7
     2    Green      11.0     9
          Red         NaN    10

In [13]:
frame.stack().unstack()

state     Colorado      Ohio
color        Green Red Green Red
key1 key2
a    1         2.0 NaN     0   1
     2         5.0 NaN     3   4
b    1         8.0 NaN     6   7
     2        11.0 NaN     9  10

## from sir Qasim

In [14]:
df1 = pd.DataFrame({"CNIC": np.random.randint(1,20, size=20),
                   "Account No":np.random.randint(1,5, size=(20))})

df1.drop_duplicates(inplace=True)
df1
#12345-1234567-3
#1234512345673

    CNIC  Account No
0      2           1
1      2           2
2      4           2
3     14           2
4      6           3
5     12           2
6     13           3
7      5           3
8     17           1
9      6           2
10     1           4
11     1           3
12     9           4
13    19           4
14    19           1
15     7           4
16    16           4
17     5           1
19     8           1

In [15]:
[chr(i) for i in range(97,123)]

['a',
 'b',
 'c',
 'd',
 'e',
 'f',
 'g',
 'h',
 'i',
 'j',
 'k',
 'l',
 'm',
 'n',
 'o',
 'p',
 'q',
 'r',
 's',
 't',
 'u',
 'v',
 'w',
 'x',
 'y',
 'z']

In [16]:
chr(122)

'z'

In [17]:
a=pd.DataFrame({"CNIC":(np.random.randint(1,20,size=20)),
               "Account No":(np.random.randint(1,5,size=20)),
               "DOB":pd.date_range("1990-01-01",freq="M",periods=20),
               "cell no":np.random.randint(2000,3000,size=20),
               "Name":[chr(x) for x in (np.random.randint(65,91,size=20))],
               "Gender":np.random.choice(["M","F"],size=20)})

In [18]:
a

    CNIC  Account No        DOB  cell no Name Gender
0      2           2 1990-01-31     2018    L      M
1     13           2 1990-02-28     2844    F      M
2     11           3 1990-03-31     2249    W      M
3     11           3 1990-04-30     2078    C      F
4     15           4 1990-05-31     2473    S      F
5     18           4 1990-06-30     2694    R      F
6      5           2 1990-07-31     2023    N      M
7      2           4 1990-08-31     2014    Q      M
8      6           3 1990-09-30     2872    Q      F
9      5           2 1990-10-31     2607    H      M
10     2           3 1990-11-30     2397    C      M
11     6           4 1990-12-31     2760    A      F
12     1           4 1991-01-31     2723    W      F
13     9           4 1991-02-28     2520    Y      M
14    12           4 1991-03-31     2386    D      M
15     9           1 1991-04-30     2599    A      F
16     1           2 1991-05-31     2232    T      M
17     3           2 1991-06-30     2545    E      M
18     3           1 1991-07-31     2027    Q      M
19    16           3 1991-08-31     2003    P      M

In [19]:
print(len(df1))
print(len(a))
b=df1.merge(a,on="CNIC",how="inner")
print(len(b))
b

19
20
23

    CNIC  Account No_x  Account No_y        DOB  cell no Name Gender
0      2             1             2 1990-01-31     2018    L      M
1      2             1             4 1990-08-31     2014    Q      M
2      2             1             3 1990-11-30     2397    C      M
3      2             2             2 1990-01-31     2018    L      M
4      2             2             4 1990-08-31     2014    Q      M
5      2             2             3 1990-11-30     2397    C      M
6      6             3             3 1990-09-30     2872    Q      F
7      6             3             4 1990-12-31     2760    A      F
8      6             2             3 1990-09-30     2872    Q      F
9      6             2             4 1990-12-31     2760    A      F
10    12             2             4 1991-03-31     2386    D      M
11    13             3             2 1990-02-28     2844    F      M
12     5             3             2 1990-07-31     2023    N      M
13     5             3             2 1990-10-31     2607    H      M
14     5             1             2 1990-07-31     2023    N      M
15     5             1             2 1990-10-31     2607    H      M
16     1             4             4 1991-01-31     2723    W      F
17     1             4             2 1991-05-31     2232    T      M
18     1             3             4 1991-01-31     2723    W      F
19     1             3             2 1991-05-31     2232    T      M
20     9             4             4 1991-02-28     2520    Y      M
21     9             4             1 1991-04-30     2599    A      F
22    16             4             3 1991-08-31     2003    P      M

In [20]:
df1.columns

Index(['CNIC', 'Account No'], dtype='object')

In [21]:
df1.columns=["Customer CNIC","Customer Account no"]

In [22]:
print(len(df1))
print(len(a))
b=df1.merge(a, left_on="Customer CNIC",right_on="CNIC",how="inner")
print(len(b))
b.drop_duplicates()

19
20
23

,Customer CNIC,Customer Account no,CNIC,Account No,DOB,cell no,Name,Gender
0,2,1,2,2,1990-01-31,2018,L,M
1,2,1,2,4,1990-08-31,2014,Q,M
2,2,1,2,3,1990-11-30,2397,C,M
3,2,2,2,2,1990-01-31,2018,L,M
4,2,2,2,4,1990-08-31,2014,Q,M
5,2,2,2,3,1990-11-30,2397,C,M
6,6,3,6,3,1990-09-30,2872,Q,F
7,6,3,6,4,1990-12-31,2760,A,F
8,6,2,6,3,1990-09-30,2872,Q,F
9,6,2,6,4,1990-12-31,2760,A,F
10,12,2,12,4,1991-03-31,2386,D,M
11,13,3,13,2,1990-02-28,2844,F,M
12,5,3,5,2,1990-07-31,2023,N,M
13,5,3,5,2,1990-10-31,2607,H,M
14,5,1,5,2,1990-07-31,2023,N,M
15,5,1,5,2,1990-10-31,2607,H,M
16,1,4,1,4,1991-01-31,2723,W,F
17,1,4,1,2,1991-05-31,2232,T,M
18,1,3,1,4,1991-01-31,2723,W,F
19,1,3,1,2,1991-05-31,2232,T,M
20,9,4,9,4,1991-02-28,2520,Y,M
21,9,4,9,1,1991-04-30,2599,A,F
22,16,4,16,3,1991-08-31,2003,P,M

In [23]:
print(len(df1))
print(len(a))
b=df1.merge(a, left_on="Customer CNIC",right_on="CNIC",how="outer")
print(len(b))
b.drop_duplicates()

19
20
36

,Customer CNIC,Customer Account no,CNIC,Account No,DOB,cell no,Name,Gender
0,2.0,1.0,2.0,2.0,1990-01-31,2018.0,L,M
1,2.0,1.0,2.0,4.0,1990-08-31,2014.0,Q,M
2,2.0,1.0,2.0,3.0,1990-11-30,2397.0,C,M
3,2.0,2.0,2.0,2.0,1990-01-31,2018.0,L,M
4,2.0,2.0,2.0,4.0,1990-08-31,2014.0,Q,M
5,2.0,2.0,2.0,3.0,1990-11-30,2397.0,C,M
6,4.0,2.0,NaN,NaN,NaT,NaN,NaN,NaN
7,14.0,2.0,NaN,NaN,NaT,NaN,NaN,NaN
8,6.0,3.0,6.0,3.0,1990-09-30,2872.0,Q,F
9,6.0,3.0,6.0,4.0,1990-12-31,2760.0,A,F
10,6.0,2.0,6.0,3.0,1990-09-30,2872.0,Q,F
11,6.0,2.0,6.0,4.0,1990-12-31,2760.0,A,F
12,12.0,2.0,12.0,4.0,1991-03-31,2386.0,D,M
13,13.0,3.0,13.0,2.0,1990-02-28,2844.0,F,M
14,5.0,3.0,5.0,2.0,1990-07-31,2023.0,N,M
15,5.0,3.0,5.0,2.0,1990-10-31,2607.0,H,M
16,5.0,1.0,5.0,2.0,1990-07-31,2023.0,N,M
17,5.0,1.0,5.0,2.0,1990-10-31,2607.0,H,M
18,17.0,1.0,NaN,NaN,NaT,NaN,NaN,NaN
19,1.0,4.0,1.0,4.0,1991-01-31,2723.0,W,F
20,1.0,4.0,1.0,2.0,1991-05-31,2232.0,T,M
21,1.0,3.0,1.0,4.0,1991-01-31,2723.0,W,F
22,1.0,3.0,1.0,2.0,1991-05-31,2232.0,T,M
23,9.0,4.0,9.0,4.0,1991-02-28,2520.0,Y,M
24,9.0,4.0,9.0,1.0,1991-04-30,2599.0,A,F
25,19.0,4.0,NaN,NaN,NaT,NaN,NaN,NaN
26,19.0,1.0,NaN,NaN,NaT,NaN,NaN,NaN
27,7.0,4.0,NaN,NaN,NaT,NaN,NaN,NaN
28,16.0,4.0,16.0,3.0,1991-08-31,2003.0,P,M
29,8.0,1.0,NaN,NaN,NaT,NaN,NaN,NaN
30,NaN,NaN,11.0,3.0,1990-03-31,2249.0,W,M
31,NaN,NaN,11.0,3.0,1990-04-30,2078.0,C,F
32,NaN,NaN,15.0,4.0,1990-05-31,2473.0,S,F
33,NaN,NaN,18.0,4.0,1990-06-30,2694.0,R,F
34,NaN,NaN,3.0,2.0,1991-06-30,2545.0,E,M
35,NaN,NaN,3.0,1.0,1991-07-31,2027.0,Q,M

In [26]:
print(len(df1))
print(len(a))
b=df1.merge(a, left_on="Customer CNIC",right_on="CNIC",how="left")
print(len(b))
b.drop_duplicates()

19
20
30

,Customer CNIC,Customer Account no,CNIC,Account No,DOB,cell no,Name,Gender
0,2,1,2.0,2.0,1990-01-31,2018.0,L,M
1,2,1,2.0,4.0,1990-08-31,2014.0,Q,M
2,2,1,2.0,3.0,1990-11-30,2397.0,C,M
3,2,2,2.0,2.0,1990-01-31,2018.0,L,M
4,2,2,2.0,4.0,1990-08-31,2014.0,Q,M
5,2,2,2.0,3.0,1990-11-30,2397.0,C,M
6,4,2,NaN,NaN,NaT,NaN,NaN,NaN
7,14,2,NaN,NaN,NaT,NaN,NaN,NaN
8,6,3,6.0,3.0,1990-09-30,2872.0,Q,F
9,6,3,6.0,4.0,1990-12-31,2760.0,A,F
10,12,2,12.0,4.0,1991-03-31,2386.0,D,M
11,13,3,13.0,2.0,1990-02-28,2844.0,F,M
12,5,3,5.0,2.0,1990-07-31,2023.0,N,M
13,5,3,5.0,2.0,1990-10-31,2607.0,H,M
14,17,1,NaN,NaN,NaT,NaN,NaN,NaN
15,6,2,6.0,3.0,1990-09-30,2872.0,Q,F
16,6,2,6.0,4.0,1990-12-31,2760.0,A,F
17,1,4,1.0,4.0,1991-01-31,2723.0,W,F
18,1,4,1.0,2.0,1991-05-31,2232.0,T,M
19,1,3,1.0,4.0,1991-01-31,2723.0,W,F
20,1,3,1.0,2.0,1991-05-31,2232.0,T,M
21,9,4,9.0,4.0,1991-02-28,2520.0,Y,M
22,9,4,9.0,1.0,1991-04-30,2599.0,A,F
23,19,4,NaN,NaN,NaT,NaN,NaN,NaN
24,19,1,NaN,NaN,NaT,NaN,NaN,NaN
25,7,4,NaN,NaN,NaT,NaN,NaN,NaN
26,16,4,16.0,3.0,1991-08-31,2003.0,P,M
27,5,1,5.0,2.0,1990-07-31,2023.0,N,M
28,5,1,5.0,2.0,1990-10-31,2607.0,H,M
29,8,1,NaN,NaN,NaT,NaN,NaN,NaN

In [25]:
print(len(df1))
print(len(a))
b=df1.merge(a, left_on="Customer CNIC",right_on="CNIC",how="right")
print(len(b))
b.drop_duplicates()

19
20
29

,Customer CNIC,Customer Account no,CNIC,Account No,DOB,cell no,Name,Gender
0,2.0,1.0,2,2,1990-01-31,2018,L,M
1,2.0,2.0,2,2,1990-01-31,2018,L,M
2,2.0,1.0,2,4,1990-08-31,2014,Q,M
3,2.0,2.0,2,4,1990-08-31,2014,Q,M
4,2.0,1.0,2,3,1990-11-30,2397,C,M
5,2.0,2.0,2,3,1990-11-30,2397,C,M
6,13.0,3.0,13,2,1990-02-28,2844,F,M
7,NaN,NaN,11,3,1990-03-31,2249,W,M
8,NaN,NaN,11,3,1990-04-30,2078,C,F
9,NaN,NaN,15,4,1990-05-31,2473,S,F
10,NaN,NaN,18,4,1990-06-30,2694,R,F
11,5.0,3.0,5,2,1990-07-31,2023,N,M
12,5.0,1.0,5,2,1990-07-31,2023,N,M
13,5.0,3.0,5,2,1990-10-31,2607,H,M
14,5.0,1.0,5,2,1990-10-31,2607,H,M
15,6.0,3.0,6,3,1990-09-30,2872,Q,F
16,6.0,2.0,6,3,1990-09-30,2872,Q,F
17,6.0,3.0,6,4,1990-12-31,2760,A,F
18,6.0,2.0,6,4,1990-12-31,2760,A,F
19,1.0,4.0,1,4,1991-01-31,2723,W,F
20,1.0,3.0,1,4,1991-01-31,2723,W,F
21,1.0,4.0,1,2,1991-05-31,2232,T,M
22,1.0,3.0,1,2,1991-05-31,2232,T,M
23,9.0,4.0,9,4,1991-02-28,2520,Y,M
24,9.0,4.0,9,1,1991-04-30,2599,A,F
25,12.0,2.0,12,4,1991-03-31,2386,D,M
26,NaN,NaN,3,2,1991-06-30,2545,E,M
27,NaN,NaN,3,1,1991-07-31,2027,Q,M
28,16.0,4.0,16,3,1991-08-31,2003,P,M